## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:113" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:113" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:1316e1dfd6596fda18546b4be75f109faaaa4a674264fe7d11acf2d54a4fc464" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:ff5564d387250865ff9dc5084190966581782b7ac08b3d26543c342532696ee2"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 113 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "c1eb6c4582c14c88518755fd68d51e7d-6" -> "3bbb7bde98cb663153ad30ddbcb8e6dd"
        id                     = "graphql.3bbb7bde98cb663153ad30ddbcb8e6dd.zip"
        tags                   = {}
      ~ version_id             = ".g2Kcz2YT0GTJALvUL4uWrD_y6KRoEzS" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "e6589ecdec5df2315bd2c4a6fd6c1e54-5" -> "0f990cba3fe4ecb7aa57e3238c68fa76"
        id                     = "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip"
        tags                   = {}
      ~ version_id             = "Jvy8PGfe734Am5BIyqYgV8UDmOG40RI0" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.2a2606a6481e5f61140e7305415691f3.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "37236f710061c76396539a1bfaf0b318-4" -> "63705f5261bd839df0881a4fdb7c47c5"
      ~ id                     = "python.2a2606a6481e5f61140e7305415691f3.zip" -> (known after apply)
      ~ key                    = "python.2a2606a6481e5f61140e7305415691f3.zip" -> "python.63705f5261bd839df0881a4fdb7c47c5.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "2a2606a6481e5f61140e7305415691f3" -> "63705f5261bd839df0881a4fdb7c47c5"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "9y6lP2J1mqlu85z2dHHU9ySkeHfdGzcD" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0fd48c186b0c0eceb5b5b5609288eab1" -> "377c150067e791ce9d7249b2eaa636d7"
        id                     = "dist/200.html"
      ~ source_hash            = "0fd48c186b0c0eceb5b5b5609288eab1" -> "377c150067e791ce9d7249b2eaa636d7"
        tags                   = {}
      ~ version_id             = "t68bG8A.D3_w8IA0Ya20wPDTSSWrtRPe" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3e14a8a4d7df67568633d10db6784fb8" -> "9a43d70f8c8706c01245e7b58a3045f0"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "3e14a8a4d7df67568633d10db6784fb8" -> "9a43d70f8c8706c01245e7b58a3045f0"
        tags                   = {}
      ~ version_id             = "DA6j95dfAgvuahzmmgN3WZ4t05z2klSG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ce48401525ca9d59b2d94d780c2fba9a" -> "d5d5df862914f6c512281c6cc282511b"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "ce48401525ca9d59b2d94d780c2fba9a" -> "d5d5df862914f6c512281c6cc282511b"
        tags                   = {}
      ~ version_id             = "hzzev0zcOQEa4JbOyejSvEZfVzbIq2jX" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0fd48c186b0c0eceb5b5b5609288eab1" -> "377c150067e791ce9d7249b2eaa636d7"
        id                     = "dist/index.html"
      ~ source_hash            = "0fd48c186b0c0eceb5b5b5609288eab1" -> "377c150067e791ce9d7249b2eaa636d7"
        tags                   = {}
      ~ version_id             = "_tux5DVs_chS6qs3IR6FDATaVNamlZTG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.57d3e404.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d59a21b61b1cc42702764173a35f9181"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.57d3e404.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.57d3e404.js"
+       source_hash            = "d59a21b61b1cc42702764173a35f9181"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.57d3e404.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.57d3e404.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.57d3e404.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a63d4cff.js"] will be destroyed
  # (because key ["static/js/app.a63d4cff.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.a63d4cff.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "a120715e473b6a5e0d2e9b05ae437128" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a63d4cff.js" -> null
-       key                    = "dist/static/js/app.a63d4cff.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a63d4cff.js" -> null
-       source_hash            = "a120715e473b6a5e0d2e9b05ae437128" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "MYfnA57g2zUB1dFjPTc9PMlYbETT8MKw" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a63d4cff.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.a63d4cff.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.a63d4cff.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a63d4cff.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.a63d4cff.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a63d4cff.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "3zktwlZHcWgOdblTEzODUKYPT1qho41r" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-24T19:56:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:80" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:80/invocations" -> (known after apply)
      ~ s3_key                         = "python.2a2606a6481e5f61140e7305415691f3.zip" -> "python.63705f5261bd839df0881a4fdb7c47c5.zip"
        tags                           = {}
      ~ version                        = "80" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a66642d416e5a3ef1f19e67655c0d4f4852113e1" -> "76c22cd1b3672c11762057af9e21cab253dea397"
              ~ "DD_TAGS"                      = "git.commit.sha:a66642d416e5a3ef1f19e67655c0d4f4852113e1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:76c22cd1b3672c11762057af9e21cab253dea397,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a66642d416e5a3ef1f19e67655c0d4f4852113e1" -> "76c22cd1b3672c11762057af9e21cab253dea397"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "80" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:128" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:128/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "128" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "a66642d416e5a3ef1f19e67655c0d4f4852113e1" -> "76c22cd1b3672c11762057af9e21cab253dea397"
              ~ "DD_TAGS"                            = "git.commit.sha:a66642d416e5a3ef1f19e67655c0d4f4852113e1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:76c22cd1b3672c11762057af9e21cab253dea397,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "a66642d416e5a3ef1f19e67655c0d4f4852113e1" -> "76c22cd1b3672c11762057af9e21cab253dea397"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "128" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:36/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "a66642d416e5a3ef1f19e67655c0d4f4852113e1" -> "76c22cd1b3672c11762057af9e21cab253dea397"
              ~ "DD_TAGS"                            = "git.commit.sha:a66642d416e5a3ef1f19e67655c0d4f4852113e1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:76c22cd1b3672c11762057af9e21cab253dea397,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "a66642d416e5a3ef1f19e67655c0d4f4852113e1" -> "76c22cd1b3672c11762057af9e21cab253dea397"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8823270999)*